Revit 2024 API
CompoundStructure.GetCoreBoundaryLayerIndex Method
 Returns the index of the layer just below the core boundary.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public int GetCoreBoundaryLayerIndex(
	ShellLayerType shellLayerType
)
Visual Basic
Public Function GetCoreBoundaryLayerIndex ( _
	shellLayerType As ShellLayerType _
) As Integer
Visual C++
public:
int GetCoreBoundaryLayerIndex(
	ShellLayerType shellLayerType
)
Parameters
shellLayerType
Type: Autodesk.Revit.DB.ShellLayerType
 If ShellLayerType.Exterior return the index on the exterior side (or top side for a roof, floor, or ceiling type). If ShellLayerType.Interior return the index on the interior side (or bottom side for a roof, floor, or ceiling type).
Return Value
 The index of the layer.
Remarks
 -1 returned if there is no such a layer. You can change the shell/core layer boundary using SetNumberOfShellLayers(ShellLayerType, Int32).
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace